dsl/poas/structurizr-1-Container-001.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram [Modernising Lasting Power of Attorney - Containers]
    style diagram fill:#ffffff,stroke:#ffffff

    34("<div style='font-weight: bold'>OPG Services</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Court Ordered Severances</div>")
    style 34 fill:#999999,stroke:#6b6b6b,color:#ffffff
    35("<div style='font-weight: bold'>Scanning Software</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>TBC</div>")
    style 35 fill:#999999,stroke:#6b6b6b,color:#ffffff
    36["<div style='font-weight: bold'>Use an LPA</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Use/View an LPA Service.<br />[Owner: UaLPA]</div>"]
    style 36 fill:#999999,stroke:#6b6b6b,color:#ffffff
    2["<div style='font-weight: bold'>Solicitor Software</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Solicitor interacting with a<br />Lasting Power of Attorney.</div>"]
    style 2 fill:#08427b,stroke:#052e56,color:#ffffff
    32("<div style='font-weight: bold'>OPG Authentication Service</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>User facing central<br />Authentication service.<br />[Owner: UaLPA, Users:<br />Modernising]</div>")
    style 32 fill:#438dd5,stroke:#2e6295,color:#ffffff

    subgraph 3 [Modernising Lasting Power of Attorney]
      style 3 fill:#ffffff,stroke:#444444,color:#444444

      13("<div style='font-weight: bold'>Public LPA Support API</div><div style='font-size: 70%; margin-top: 0px'>[Container: API Gateway, Go]</div><div style='font-size: 80%; margin-top:10px'>Allows external companies to<br />add submit LPAs. [Owner:<br />Vega, Users: Modernising]</div>")
      style 13 fill:#438dd5,stroke:#2e6295,color:#ffffff
      14("<div style='font-weight: bold'>LPA ID Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: API Gateway, Go]</div><div style='font-size: 80%; margin-top:10px'>Manages the LPA IDs.</div>")
      style 14 fill:#438dd5,stroke:#2e6295,color:#ffffff
      15[("<div style='font-weight: bold'>Registered LPA Data Store</div><div style='font-size: 70%; margin-top: 0px'>[Container: AuroraDB]</div><div style='font-size: 80%; margin-top:10px'>Stores immutable LPA data<br />with high availablility,<br />security and auditing.<br />[Owner: Modernising, Users:<br />Vega]</div>")]
      style 15 fill:#438dd5,stroke:#2e6295,color:#ffffff
      18("<div style='font-weight: bold'>Registered LPA Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: API Gateway]</div><div style='font-size: 80%; margin-top:10px'>Highly available API for<br />reading and searching the LPA<br />Register. [Owner: Vega,<br />Users: UaLPA, Modernising]</div>")
      style 18 fill:#438dd5,stroke:#2e6295,color:#ffffff
      23("<div style='font-weight: bold'>LPA Paper Ingestion Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: API Gateway, Go]</div><div style='font-size: 80%; margin-top:10px'>Handles the ingestion of the<br />Paper Journey. [Owner:<br />Modernising, Users: Vega]</div>")
      style 23 fill:#438dd5,stroke:#2e6295,color:#ffffff
      24("<div style='font-weight: bold'>Sirius Public API</div><div style='font-size: 70%; margin-top: 0px'>[Container: API Gateway, Go]</div><div style='font-size: 80%; margin-top:10px'>Interaction point between<br />Sirius Case Management and<br />other services. [Owner: Vega,<br />Users: UaLPA, Modernising]</div>")
      style 24 fill:#999999,stroke:#6b6b6b,color:#ffffff
      25("<div style='font-weight: bold'>OPG Internal Payment Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: API Gateway, Go]</div><div style='font-size: 80%; margin-top:10px'>Handles GOV.UK Pay and<br />Remissions and Exemptions<br />information between all<br />services and Sirius. [Owner:<br />Vega, Users: Modernising]</div>")
      style 25 fill:#999999,stroke:#6b6b6b,color:#ffffff
      26("<div style='font-weight: bold'>Sirius Case Management</div><div style='font-size: 70%; margin-top: 0px'>[Container: Go, HTML, CSS, JS]</div><div style='font-size: 80%; margin-top:10px'>Case Management for case<br />working LPAs. [Owner: Vega,<br />Users: Modernising]</div>")
      style 26 fill:#85bbf0,stroke:#5d82a8,color:#000000
      4["<div style='font-weight: bold'>Make a Lasting Power of Attorney Online</div><div style='font-size: 70%; margin-top: 0px'>[Container: Go, HTML, CSS, JS]</div><div style='font-size: 80%; margin-top:10px'>Allows users to draft a<br />Lasting Power of Attorney<br />online. [Owner: Modernising,<br />Users: Vega]</div>"]
      style 4 fill:#438dd5,stroke:#2e6295,color:#ffffff
      8("<div style='font-weight: bold'>LPA Drafting Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: API Gateway, Go, DynamoDB]</div><div style='font-size: 80%; margin-top:10px'>Stores and manages data for<br />pre-registration. [Owner:<br />Modernising, Users: Vega]</div>")
      style 8 fill:#438dd5,stroke:#2e6295,color:#ffffff
    end

    34-. "<div>sends data to</div><div style='font-size: 70%'></div>" .->26
    35-. "<div>sends scanned LPA Data to</div><div style='font-size: 70%'></div>" .->23
    13-. "<div>makes calls to</div><div style='font-size: 70%'></div>" .->8
    2-. "<div>interacts with</div><div style='font-size: 70%'></div>" .->13
    4-. "<div>makes calls to</div><div style='font-size: 70%'></div>" .->8
    8-. "<div>gets LPA Code from</div><div style='font-size: 70%'></div>" .->14
    26-. "<div>gets LPA Code from</div><div style='font-size: 70%'></div>" .->14
    8-. "<div>writes validated data to</div><div style='font-size: 70%'></div>" .->18
    8-. "<div>writes case management data<br />to and read data from</div><div style='font-size: 70%'></div>" .->24
    4-. "<div>authenticates with</div><div style='font-size: 70%'></div>" .->32
    36-. "<div>authenticates with</div><div style='font-size: 70%'></div>" .->32
    36-. "<div>read data from</div><div style='font-size: 70%'></div>" .->24
    36-. "<div>read data from</div><div style='font-size: 70%'></div>" .->18
    18-. "<div>writes data to</div><div style='font-size: 70%'></div>" .->15
    26-. "<div>writes and read data from</div><div style='font-size: 70%'></div>" .->25
    24-. "<div>writes and read data from</div><div style='font-size: 70%'></div>" .->26
    23-. "<div>reads data from</div><div style='font-size: 70%'></div>" .->24
    23-. "<div>writes data to</div><div style='font-size: 70%'></div>" .->8
    26-. "<div>reads data from</div><div style='font-size: 70%'></div>" .->18
  end
